; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   fridgetype microwavetype sinkbasintype - receptacletype
   knifetype butterknifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   handtowelholdertype dressertype diningtabletype toiletpaperhangertype cabinettype shelftype - receptacletype
   kettletype soapbartype laptoptype alarmclocktype papertoweltype pentype creditcardtype pottype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   fridge_1 handtowelholder_2 sinkbasin_3 dresser_4 diningtable_5 toiletpaperhanger_6 cabinet_7 shelf_8 microwave_9 fridge_10 - receptacle
   kettle_1 soapbar_2 laptop_3 alarmclock_4 papertowel_5 pen_6 creditcard_7 pot_8 - obj
 )
 (:init (receptacletype_0 fridge_1 fridgetype) (receptacletype_0 handtowelholder_2 handtowelholdertype) (receptacletype_0 sinkbasin_3 sinkbasintype) (receptacletype_0 dresser_4 dressertype) (receptacletype_0 diningtable_5 diningtabletype) (receptacletype_0 toiletpaperhanger_6 toiletpaperhangertype) (receptacletype_0 cabinet_7 cabinettype) (receptacletype_0 shelf_8 shelftype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 kettle_1 kettletype) (objecttype_0 soapbar_2 soapbartype) (objecttype_0 laptop_3 laptoptype) (objecttype_0 alarmclock_4 alarmclocktype) (objecttype_0 papertowel_5 papertoweltype) (objecttype_0 pen_6 pentype) (objecttype_0 creditcard_7 creditcardtype) (objecttype_0 pot_8 pottype) (cancontain fridgetype pottype) (cancontain sinkbasintype kettletype) (cancontain sinkbasintype soapbartype) (cancontain sinkbasintype pottype) (cancontain dressertype laptoptype) (cancontain dressertype alarmclocktype) (cancontain dressertype pentype) (cancontain dressertype creditcardtype) (cancontain diningtabletype kettletype) (cancontain diningtabletype soapbartype) (cancontain diningtabletype laptoptype) (cancontain diningtabletype alarmclocktype) (cancontain diningtabletype papertoweltype) (cancontain diningtabletype pentype) (cancontain diningtabletype creditcardtype) (cancontain diningtabletype pottype) (cancontain cabinettype kettletype) (cancontain cabinettype soapbartype) (cancontain cabinettype pottype) (cancontain shelftype kettletype) (cancontain shelftype soapbartype) (cancontain shelftype alarmclocktype) (cancontain shelftype papertoweltype) (cancontain shelftype pentype) (cancontain shelftype creditcardtype) (cancontain shelftype pottype) (pickupable kettle_1) (cleanable kettle_1) (pickupable soapbar_2) (cleanable soapbar_2) (pickupable laptop_3) (pickupable alarmclock_4) (pickupable papertowel_5) (pickupable pen_6) (pickupable creditcard_7) (pickupable pot_8) (isreceptacleobject pot_8) (cleanable pot_8) (coolable pot_8) (receptacleatlocation fridge_1 location2) (receptacleatlocation handtowelholder_2 location5) (receptacleatlocation sinkbasin_3 location4) (receptacleatlocation dresser_4 location1) (receptacleatlocation diningtable_5 location5) (receptacleatlocation toiletpaperhanger_6 location5) (receptacleatlocation cabinet_7 location4) (receptacleatlocation shelf_8 location3) (receptacleatlocation microwave_9 location5) (receptacleatlocation fridge_10 location5) (inreceptacle kettle_1 cabinet_7) (inreceptacle soapbar_2 sinkbasin_3) (inreceptacle laptop_3 dresser_4) (inreceptacle alarmclock_4 shelf_8) (inreceptacle papertowel_5 diningtable_5) (inreceptacle pen_6 diningtable_5) (inreceptacle creditcard_7 diningtable_5) (inreceptacle pot_8 fridge_10) (objectatlocation kettle_1 location4) (objectatlocation soapbar_2 location4) (objectatlocation laptop_3 location1) (objectatlocation alarmclock_4 location3) (objectatlocation papertowel_5 location5) (objectatlocation pen_6 location5) (objectatlocation creditcard_7 location5) (objectatlocation pot_8 location5) (atlocation agent1 location5) (= (total-cost) 0))
 (:goal (and (exists (?r_0 - receptacle)
 (exists (?o1 - obj)
 (and (inreceptacle ?o1 ?r_0) (objecttype_0 ?o1 alarmclocktype) (receptacletype_0 ?r_0 diningtabletype) (exists (?o2 - obj)
 (and (not (= ?o1 ?o2)) (objecttype_0 ?o2 papertoweltype) (receptacletype_0 ?r_0 diningtabletype) (inreceptacle ?o2 ?r_0))))))))
 (:constraints (sometime (checked cabinet_7)))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location5 location4)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location4)
   goals met: 0 of 1
2. (examinereceptacle agent1 cabinet_7)
   added: (checked cabinet_7)
   goals met: 0 of 1
3. (gotolocation agent1 location4 location3)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
4. (pickupobject agent1 location3 alarmclock_4 shelf_8)
   deleted: (inreceptacle alarmclock_4 shelf_8) (objectatlocation alarmclock_4 location3)
   added: (holds agent1 alarmclock_4) (holdsany agent1)
   goals met: 0 of 1
5. (gotolocation agent1 location3 location5)
   deleted: (atlocation agent1 location3)
   added: (atlocation agent1 location5)
   goals met: 0 of 1
6. (putobject agent1 location5 alarmclock_4 diningtable_5 alarmclocktype diningtabletype)
   deleted: (holds agent1 alarmclock_4) (holdsany agent1)
   added: (inreceptacle alarmclock_4 diningtable_5) (objectatlocation alarmclock_4 location5)
   goals met: 1 of 1
